In [4]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
from scripts import project_functions as pf

In [5]:
# Load data from National Names
national_df = pf.load_and_process_one('../../data/raw/national/NationalNames.csv')
# Load 4 parts of raw data on State Names
state_df = pf.load_and_process_many("../../data/raw/state")

In [6]:
state_df

             Name  Year Gender State  Count
0            Mary  1910      F    AK     14
1           Annie  1910      F    AK     12
2            Anna  1910      F    AK     10
3        Margaret  1910      F    AK      8
4           Helen  1910      F    AK      7
...           ...   ...    ...   ...    ...
5647421      Seth  2014      M    WY      5
5647422   Spencer  2014      M    WY      5
5647423      Tyce  2014      M    WY      5
5647424    Victor  2014      M    WY      5
5647425    Waylon  2014      M    WY      5

[5647426 rows x 5 columns]

## Tasks
- Separate the states into 4 regions: Western, southern, eastern and northern.
- Compare the top five most popular girls/boys name in four different regions (half for Jamie, half for me).
- North East and South is the main focus for Jamie.

## Analysis

### Filtering north east and south

In [7]:
# Note that the project_fuctions module includes list of abbreviations for states separated in regions
# Let's slice out only the north east and south

n_df = state_df.loc[state_df["State"].isin(pf.NORTH_EAST)].reset_index(drop=True)
n_df

             Name  Year Gender State  Count
0            Mary  1910      F    CT    304
1           Helen  1910      F    CT    170
2            Anna  1910      F    CT    131
3        Margaret  1910      F    CT     99
4         Dorothy  1910      F    CT     90
...           ...   ...    ...   ...    ...
1077883   Richard  2014      M    VT      5
1077884     Rowan  2014      M    VT      5
1077885     Simon  2014      M    VT      5
1077886    Skyler  2014      M    VT      5
1077887    Wilder  2014      M    VT      5

[1077888 rows x 5 columns]

In [8]:
s_df = state_df.loc[state_df["State"].isin(pf.SOUTH)].reset_index(drop=True)
s_df

             Name  Year Gender State  Count
0            Mary  1910      F    AL    875
1           Annie  1910      F    AL    482
2          Willie  1910      F    AL    257
3          Mattie  1910      F    AL    232
4            Ruby  1910      F    AL    204
...           ...   ...    ...   ...    ...
2173016    Pierce  2014      M    WV      5
2173017   Quinton  2014      M    WV      5
2173018     Reece  2014      M    WV      5
2173019  Sterling  2014      M    WV      5
2173020    Warren  2014      M    WV      5

[2173021 rows x 5 columns]

### Find top 5

In [30]:
# For the north east
n_name = (n_df.groupby(by="Name")
              .aggregate("sum")
              .drop(columns=["Year"]) # We do not analyze with time
              .sort_values(by="Count")
              .reset_index()
         )
top5_n,low5_n = n_name.tail().reset_index(drop=True), n_name.head()
print(top5_n, "\n\n",low5_n)

      Name    Count
0  William  1076081
1    James  1101436
2  Michael  1240416
3   Robert  1379644
4     John  1567661

       Name  Count
0  Jasmely      5
1   Leonid      5
2  Serrita      5
3   Franne      5
4    Frann      5

In [60]:
test = (n_name.loc[(n_name["Count"] > 1000000) | (n_name["Count"] <= 5)]
         .sort_values(by="Count", ascending=False)
         .head(20)
         .reset_index(drop=True)
        )
test

         Name    Count
0        John  1567661
1      Robert  1379644
2     Michael  1240416
3       James  1101436
4     William  1076081
5       Hudes        5
6        Hudy        5
7      Anaria        5
8    Adrielle        5
9    Haniyyah        5
10    Nyzaiah        5
11  Anastacio        5
12      Yitel        5
13     Yianna        5
14    Shaquia        5
15   Jahnasia        5
16   Angeleah        5
17      Zishe        5
18     Melena        5
19    Nasirah        5